{"id": "f2d566e8df7721fc485238084fc513b3", "source_kind": "news", "source_name": "RCR Wireless", "source_url": "https://www.rcrwireless.com/feed", "title": "Reliance Jio claims 234 million 5G subs, 50% 5G traffic", "link": "https://www.rcrwireless.com/20251020/5g/reliance-jio-5g-3", "summary": "Jio claims 5G now accounts for approximately 50% of its overall wireless traffic, as its Q4 numbers rocket – by more than 20 million in the quarter. In sum – what to know: 5G drives network load – Half of Jio’s total wireless traffic now runs on 5G, showing rapid customer migration across India’s largest [&#8230;]", "published_date": "2025-10-20"}
{"id": "e8fe0261df4d858c88f6e28626ca15c9", "source_kind": "news", "source_name": "RCR Wireless", "source_url": "https://www.rcrwireless.com/feed", "title": "GSMA Webinar: The Programmable Network: API-Driven Value for the Entire Ecosystem", "link": "https://content.rcrwireless.com/webinar-the-programmable-network", "summary": "The global mobile industry stands at a critical juncture. A shift is underway to transform telecommunication networks from simple connectivity pipes into intelligent, programmable platforms. Through standardized Network APIs and initiatives like GSMA Open Gateway and CAMARA, the industry is creating a unified, cross-operator framework to expose powerful network capabilities. This enables developers and enterprises [&#8230;]", "published_date": "2025-10-20"}
{"id": "991b2b6f12d29fcda5341cc2b9b3dc0c", "source_kind": "news", "source_name": "RCR Wireless", "source_url": "https://www.rcrwireless.com/feed", "title": "Turkcell tops the bill as Turkish 5G auction raises nearly $3 billion", "link": "https://www.rcrwireless.com/20251020/5g/turkish-5g-auction", "summary": "Turkcell is the biggest spender in the Turkish 5G auction, paying $429 million for the A1 block in the 700MHz band and securing four additional blocks in the 3.5GHz range –bringing its total expenditure to over $1.2 billion In sum – what to know: Beats expectations – Turkish government raised nearly $3 billion, well above [&#8230;]", "published_date": "2025-10-20"}
{"id": "bb0e4d13f9f27c3cfd9959961c3c0385", "source_kind": "news", "source_name": "RCR Wireless", "source_url": "https://www.rcrwireless.com/feed", "title": "Powering the future: New research gives significant insight to make 5G and NextG networks more energy efficient (Reader Forum)", "link": "https://www.rcrwireless.com/20251020/5g/powering-the-future-5g-and-nextg-networks", "summary": "As 5G networks continue their global expansion, a critical challenge looms large: growing power consumption generating inordinate operational expenses along with associated carbon output. Considering various projections, it is possible that by 2030, mobile networks could potentially end up consuming 5% of the world&#8217;s total electricity usage if current trends persist, with base stations responsible [&#8230;]", "published_date": "2025-10-20"}
{"id": "a7c381b0b96bf3fc9eeb10f62c27b970", "source_kind": "news", "source_name": "RCR Wireless", "source_url": "https://www.rcrwireless.com/feed", "title": "UK telcos secure mmWave spectrum to boost 5G", "link": "https://www.rcrwireless.com/20251017/5g/uk-telcos-spectrum", "summary": "Ofcom noted that the auction released 5.4 GHz of high-frequency spectrum In sum – what to know: mmWave spectrum secured – EE, O2, and VodafoneThree will pay a combined £39 million to enhance 5G capacity in crowded UK locations. 5.4 GHz of spectrum – Ofcom auctioned the largest-ever block of high-frequency spectrum across the 26 [&#8230;]", "published_date": "2025-10-17"}
{"id": "3163e82cdbd059dadd85cf31d64646da", "source_kind": "news", "source_name": "RCR Wireless", "source_url": "https://www.rcrwireless.com/feed", "title": "The compute industrial complex (Analyst Angle)", "link": "https://www.rcrwireless.com/20251017/analyst-angle/compute-industrial-complex", "summary": "AI’s future depends less on algorithms and more on the physical realities of silicon, power, capital, and geopolitics The artificial intelligence sector has entered a new industrial phase. For two decades, the cloud business model created the illusion that computing capacity was an elastic, on-demand resource. That model worked because capital was cheap, semiconductors were [&#8230;]", "published_date": "2025-10-17"}
{"id": "d549ef6e0713f1adbd576ccdddd185c1", "source_kind": "news", "source_name": "RCR Wireless", "source_url": "https://www.rcrwireless.com/feed", "title": "Three sides of Industry 4.0 – industrial AI in numbers (part 3)", "link": "https://www.rcrwireless.com/20251017/fundamentals/industrial-ai-in-numbers", "summary": "Industrial AI has moved from experimental pilots to boardroom strategy. The global market was worth $43.6 billion in 2024, and is growing at 23 percent per year. While most of the real value still lies in proven, production-grade use cases such as machine vision and predictive maintenance, generative AI is driving new interest, and new [&#8230;]", "published_date": "2025-10-17"}
{"id": "c2c015676400d440d543e7f06ec3f50a", "source_kind": "news", "source_name": "RCR Wireless", "source_url": "https://www.rcrwireless.com/feed", "title": "SK Telecom offers voluntary retirement as new AI division undergoes reorganization", "link": "https://www.rcrwireless.com/20251017/carriers/sk-telecom-ai-division", "summary": "SK Telecom is restructuring its new AI division and doubles down on infrastructure In sum – what to know: AI-first pivot – SK Telecom is restructuring its new AI division just weeks after launch, consolidating units and offering voluntary retirement as it targets ₩5 trillion (~$3.5B) in annual AI revenue by 2030. Infrastructure ambition – The [&#8230;]", "published_date": "2025-10-17"}
{"id": "e412802ab89d529fa03505778cccc987", "source_kind": "news", "source_name": "RCR Wireless", "source_url": "https://www.rcrwireless.com/feed", "title": "Three sides of Industry 4.0 – industrial IoT in numbers (part 2)", "link": "https://www.rcrwireless.com/20251017/fundamentals/industrial-iot-in-numbers", "summary": "IoT has always been more concept than category – like a loose collection of private device networks. And it makes increasingly good sense to enterprises alongside industrial 5G networks and industrial AI systems. New research from Verizon Business says IoT is finally “moving to centre stage” – with soaring optimism, rapid scaling, and deepening integration [&#8230;]", "published_date": "2025-10-17"}
{"id": "a27b9c055c1177d9fa1f0e93fa9032ae", "source_kind": "news", "source_name": "RCR Wireless", "source_url": "https://www.rcrwireless.com/feed", "title": "Three sides of Industry 4.0 – industrial 5G in numbers (part 1)", "link": "https://www.rcrwireless.com/20251017/fundamentals/industrial-5g-in-numbers", "summary": "Three sides of Industry 4.0 – industrial 5G in numbers (part 1) Private 5G continues to outpace the broader telecoms market, with enterprise deployments expanding and industrial use cases taking shape. New data from Dell’Oro Group shows sustained almost-double-digit growth and a gradual shift in focus – from enterprise connectivity experiments to production-grade industrial applications. [&#8230;]", "published_date": "2025-10-17"}
